#include <iostream>


int clearBit(int num, int pos) {
    // Създаване на маската: 1 << pos измества единицата на желаната позиция
    // Обръщаме всички битове (~) за да получим маска с нулиране на желаната позиция
    int mask = ~(1 << pos);

    // Прилагане на маската с побитово AND
    return num & mask;
}

int main() {
    int num = 29; // Например числото 29 в двоична система е 11101
    int pos = 3;  // Нулиране на бит на позиция 3 (броенето започва от 0)

    std::cout << clearBit(num, pos);
}